/* Copyright 2021 Simon Willcocks
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

const unsigned module_flags = 3;
// Bit 0: 32-bit compatible
// Bit 1: Multiprocessing
//   New feature: instead of one private word per core, r12 points to a shared
//   word, initialised by the first core to initialise the module.

// Explicitly no SWIs provided (it's the default, anyway)
#define MODULE_CHUNK "0"

#include "module.h"

#include "include/taskop.h"

NO_start;
//NO_init;
NO_finalise;
//NO_service_call;
//NO_title;
//NO_help;
NO_keywords;
NO_swi_handler;
NO_swi_names;
NO_swi_decoder;
NO_messages_file;

const char title[] = "Raspberry Pi 3 HAL";
const char help[] = "HAL\t0.01";

typedef struct {
  uint32_t       control;
  uint32_t       res1;
  uint32_t       timer_prescaler;
  uint32_t       GPU_interrupts_routing;
  uint32_t       Performance_Monitor_Interrupts_routing_set;
  uint32_t       Performance_Monitor_Interrupts_routing_clear;
  uint32_t       res2;
  uint32_t       Core_timer_access_LS_32_bits; // Access first when reading/writing 64 bits.
  uint32_t       Core_timer_access_MS_32_bits;
  uint32_t       Local_Interrupt_routing0;
  uint32_t       Local_Interrupts_routing1;
  uint32_t       Axi_outstanding_counters;
  uint32_t       Axi_outstanding_IRQ;
  uint32_t       Local_timer_control_and_status;
  uint32_t       Local_timer_write_flags;
  uint32_t       res3;
  uint32_t       Core_timers_Interrupt_control[4];
  uint32_t       Core_Mailboxes_Interrupt_control[4];
  uint32_t       Core_IRQ_Source[4];
  uint32_t       Core_FIQ_Source[4];
  struct {
    uint32_t       Mailbox[4]; // Write only!
  } Core_write_set[4];
  struct {
    uint32_t       Mailbox[4]; // Read/write
  } Core_write_clear[4];
} QA7;

// Note: Alignment is essential for device area, so that GCC doesn't
// generate multiple strb instructions to write a single word.
// Or I could be professional and make every device access an inline
// routine call. Nah!
struct __attribute__(( packed, aligned( 256 ) )) gpio {
  uint32_t gpfsel[6];  // 0x00 - 0x14
  uint32_t res18;
  uint32_t gpset[2];   // 0x1c, 0x20
  uint32_t res24;
  uint32_t gpclr[2];
  uint32_t res30;     // 0x30
  uint32_t gplev[2];
  uint32_t res3c;
  uint32_t gpeds[2];   // 0x40
  uint32_t res48;
  uint32_t gpren[2];
  uint32_t res54;
  uint32_t gpfen[2];
  uint32_t res60;     // 0x60
  uint32_t gphen[2];
  uint32_t res6c;
  uint32_t gplen[2];    // 0x70
  uint32_t res78;
  uint32_t gparen[2];
  uint32_t res84;
  uint32_t gpafen[2];
  uint32_t res90;     // 0x90
  uint32_t gppud;
  uint32_t gppudclk[2];
  uint32_t resa0;
  uint32_t resa4;
  uint32_t resa8;
  uint32_t resac;
  uint32_t test;
};

typedef struct __attribute__(( packed )) {
  uint32_t data;                                // 0x00
  uint32_t receive_status_error_clear;          // 0x04
  uint32_t res0[4];
  uint32_t flags;                               // 0x18
  uint32_t res1[2];
  uint32_t integer_baud_rate_divisor;           // 0x24
  uint32_t fractional_baud_rate_divisor;        // 0x28
  uint32_t line_control;                        // 0x2c
  uint32_t control;                             // 0x30
  uint32_t interrupt_fifo_level_select;         // 0x34
  uint32_t interrupt_mask_set_clear;            // 0x38
  uint32_t raw_interrupt_status;                // 0x3c
  uint32_t masked_interrupt_status;             // 0x40
  uint32_t interrupt_clear;                     // 0x44
  uint32_t dma_control;                         // 0x48
  uint32_t res2[(0x80-0x4c)/4];
  uint32_t test_control;                        // 0x80
  uint32_t integration_test_input;              // 0x84
  uint32_t integration_test_output;             // 0x88
  uint32_t test_data;                           // 0x8c
} UART;

typedef struct {
  uint32_t value; // Request or Response, depending if from or to ARM,
                  // (Pointer & 0xfffffff0) | Channel 0-15
  uint32_t res1;
  uint32_t res2;
  uint32_t res3;
  uint32_t peek;  // Doesn't remove the value from the FIFO
  uint32_t sender;// ??
  uint32_t status;// bit 31: Tx full, 30: Rx empty
  uint32_t config;
} GPU_mailbox;

typedef struct __attribute__(( packed )) {
  uint32_t to0x200[0x200/4];
  // 0x200
  union {
    struct {
      uint32_t basic_pending;
      uint32_t pending1;
      uint32_t pending2;
      uint32_t fiq_control;
      uint32_t enable_irqs1;
      uint32_t enable_irqs2;
      uint32_t enable_basic;
      uint32_t disable_irqs1;
      uint32_t disable_irqs2;
      uint32_t disable_basic;
    };
    uint32_t to0x400[0x200/4];
  };
  // 0x400
  union {
    struct {
      uint32_t load;
      uint32_t value;
      uint32_t control;
      uint32_t irq;
